app/views/users/show.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 2]]
---
<h2>ユーザーの投稿一覧</h2>
<% @user.tweets.each do |t| %>