app/controllers/tweets_controller.rb

    def create
        tweet = Tweet.new(tweet_params)

        #current_user:ログインしているuserの情報を取得
        tweet.user_id = current_user.id


        if tweet.save
---
INSERT INTO "tweets" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["body", "おはよう"], ["created_at", "2024-02-21 11:58:50.950569"], ["updated_at", "2024-02-21 11:58:50.950569"], ["user_id", 1]]

    def show
        @tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]